* TODO Get with James about testing the report fixtures
* TODO Gather all quote info into a real quote
  CLOCK: [2015-05-19 Tue 11:17]--[2015-05-19 Tue 14:07] =>  2:50
* TODO Furnish Steve his quote
  CLOCK: [2015-05-19 Tue 15:34]--[2015-05-19 Tue 16:28] =>  0:54
  I put a hold on this until I get things in proper condition to actually add the report and driver info



* DONE Work on C# driver
  CLOCK: [2015-05-21 Thu 23:31]--[2015-05-22 Fri 01:31] =>  2:00
* DONE Add button 'all-reports' for onping kiosk
